app/views/users_groups/index.html.erb

        <td><%= users_group.user_id %></td>
        <td><%= User.select("name").where("id = ?", users_group.user_id).first.name %></td>
---
SELECT  `users`.`name` FROM `users` WHERE (id = 8)  ORDER BY `users`.`id` ASC LIMIT 1