app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`name`, `description`, `created_at`, `updated_at`) VALUES ('11', '1111', '2017-04-12 03:44:24', '2017-04-12 03:44:24')

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE `groups` SET `description` = '1122', `updated_at` = '2017-04-13 20:16:13' WHERE `groups`.`id` = 3

  def destroy
    # 首先需要删除用户组内成员信息，也就是UsersGroup中该用户组的信息
    UsersGroup.destroy_all(" group_id = 1 ")
---
DELETE FROM `groups` WHERE `groups`.`id` = 1