app/controllers/project_users_controller.rb

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1
---
  def index
    @project = Project.find(params[:project_id])

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `groups`.* FROM `groups`
SELECT `users_groups`.* FROM `users_groups`
SELECT id, name FROM `users`
---
  def new
    # 获取当前项目
    @project = Project.find(params[:project_id])
    @project_user = ProjectUser.new
    # 获取所有用户组成员信息
    @users_groups = UsersGroup.all
    # 用户的角色
    @project_roles = ProjectUser::PROJECT_ROLES
    # 获取所有用户的
    @users = User.select("id, name")

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
INSERT INTO `project_users` (`project_id`, `user_id`, `project_role`, `created_at`, `updated_at`) VALUES (6, 2, '1', '2017-04-13 09:33:14', '2017-04-13 09:33:14')
---
  def create
    @project = Project.find(params[:project_id])
    # para = ActionController::Parameters.new({ project_user: { project_id: params[:project_id], user_id: params[:user_id], project_role: params[:project_role] }})
    # permitted = para.require(:project_user).permit(:project_id, :user_id, :project_role)
    p params
    params[:project_user][:project_id] = params[:project_id]

    p params
    @project_user = ProjectUser.new(project_user_params)

    p @project_user

    respond_to do |format|

      if @project_user.save

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 6 LIMIT 1
DELETE FROM `project_users` WHERE `project_users`.`id` = 1
---
  def destroy
    @project = Project.find(params[:project_id])
    @project_user.destroy

SELECT  `project_users`.* FROM `project_users` WHERE `project_users`.`id` = 1 LIMIT 1
---
    def set_project_user
      @project_user = ProjectUser.find(params[:id])