app/controllers/project_users_controller.rb

SELECT `project_users`.* FROM `project_users`
---
  def index
    @project_users = ProjectUser.all