app/controllers/projects_controller.rb

INSERT INTO `projects` (`abbr_name`, `name`, `proj_types`, `proj_start_time`, `proj_end_time`, `created_at`, `updated_at`) VALUES ('123', '132', '123', '2014-02-02 00:00:00', '2014-02-02 00:00:00', '2017-04-11 09:55:12', '2017-04-11 09:55:12')
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE `projects` SET `proj_start_time` = '2014-12-15 00:00:00', `proj_end_time` = '2014-12-16 00:00:00', `updated_at` = '2017-04-11 11:18:43' WHERE `projects`.`id` = 2
---
  def update
    respond_to do |format|
      if @project.update(project_params)

UPDATE `projects` SET `deleted_at` = '2017-04-11 11:59:31', `updated_at` = '2017-04-11 11:59:31' WHERE `projects`.`id` = 2
---
  def destroy
    # @project.destroy
    # Soft delete an item.
    @project.update_attribute(:deleted_at, Time.now)

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
---
    def set_project
      @project = Project.find(params[:id])