app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      @user.update_column(:actived, false) if user_params[:actived].nil?
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `description`, `created_at`, `updated_at`) VALUES ('23', '23@11.com', '!@#!@3', '2017-04-12 02:19:22', '2017-04-12 02:19:22')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `description` = '456445646', `updated_at` = '2017-04-12 02:19:33' WHERE `users`.`id` = 1

  def destroy
    UsersGroup.where("user_id = ?", @user.id).delete_all
---
DELETE FROM `users_groups` WHERE (user_id = 13)
DELETE FROM `users` WHERE `users`.`id` = 1