app/controllers/user_groups_controller.rb

SELECT `user_groups`.* FROM `user_groups`
---
  def index
    @user_groups = UserGroup.all

INSERT INTO `user_groups` (`name`, `description`, `created_at`, `updated_at`) VALUES ('PMTD1', 'PMTD1', '2017-04-12 02:19:53', '2017-04-12 02:19:53')
---
  def create
    @user_group = UserGroup.new(user_group_params)

    respond_to do |format|
      if @user_group.save

SELECT  `user_groups`.* FROM `user_groups` WHERE `user_groups`.`id` = 1 LIMIT 1
---
    def set_user_group
      @user_group = UserGroup.find(params[:id])