app/controllers/users_groups_controller.rb

SELECT `users_groups`.* FROM `users_groups` WHERE (group_id = NULL)
---
  def index
    @users_groups = UsersGroup.where("group_id = ?", params[:group_id])

INSERT INTO `users_groups` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 2, '2017-04-12 10:55:13', '2017-04-12 10:55:13')
---
  def create_collection
    group_id = params[:group_id]
    params[:id].each do |user_id|
      para = ActionController::Parameters.new({ users_group: { group_id: group_id, user_id: user_id }})
      permitted = para.require(:users_group).permit(:group_id, :user_id)
      @users_group = UsersGroup.new(permitted)
      @users_group.save

SELECT `users_groups`.`user_id` FROM `users_groups` WHERE (group_id = '1')
SELECT `users`.* FROM `users`
---
  def new
    @users_groups = UsersGroup.select(:user_id).where("group_id = ?", params[:group_id])
    @users = User.all

DELETE FROM `users_groups` WHERE (group_id = NULL AND user_id = NULL)
---
  def destroy()
    UsersGroup.delete_all(["group_id = ? AND user_id = ?", params[:group_id], params[:id]])