app/views/project_users/index.html.erb

SELECT  `users`.`name` FROM `users` WHERE (id = 'user_id')  ORDER BY `users`.`id` ASC LIMIT 1
---
        <td><%= project_user.user_id %></td>
        <td><%= User.select("name").where("id = ?", project_user.user_id).first.name %></td>