app/views/project_users/new.html.erb

    <label for="name">选择用户组</label>
    <%= select_tag "group_id", options_from_collection_for_select(Group.all, :id, :name), class: "form-control" %>
---
SELECT `groups`.* FROM `groups`

      })[0].name;
      o.value = users_id[i].user_id;
---
SELECT id, name FROM `users`